app/views/rentals/new.html.erb

SELECT `rentals`.* FROM `rentals` WHERE `rentals`.`movie_id` = 11
---
<hr>
<% if @movie.rentals.exists? %>