app/controllers/movies_controller.rb

INSERT INTO `movies` (`created_at`, `title`, `updated_at`, `year`) VALUES (?, ?, ?, ?)  [["created_at", Thu, 14 Jun 2012 05:34:43 UTC +00:00], ["title", "sads"], ["updated_at", Thu, 14 Jun 2012 05:34:43 UTC +00:00], ["year", 0]]
---
  def create
   @movie = Movie.create(params[:movie])