app/controllers/rentals_controller.rb

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = ? LIMIT 1  [["id", "1"]]
---
	def new
		@movie = Movie.find(params[:id])

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = ? LIMIT 1  [["id", "11"]]
INSERT INTO `rentals` (`created_at`, `given_on`, `movie_id`, `taking_on`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 14 Jun 2012 06:50:15 UTC +00:00], ["given_on", Sat, 22 Dec 2012], ["movie_id", 11], ["taking_on", Sat, 22 Dec 2012], ["updated_at", Thu, 14 Jun 2012 06:50:15 UTC +00:00]]
---
	def create
		@movie = Movie.find(params[:id])
		@rental = @movie.rentals.build(params[:rental])
	  if @rental.save